perf-tests/results_v3_20260421_095020/go/k6_stress_customer_summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /Users/naghayev/Desktop/investigate_bff/perf-tests/k6_stress.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m50s max duration (incl. graceful stop):
              * default: Up to 200 looping VUs for 1m20s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 010/200 VUs, 45 complete and 0 interrupted iterations
default   [   1% ] 010/200 VUs  0m01.0s/1m20.0s

running (0m02.0s), 020/200 VUs, 190 complete and 0 interrupted iterations
default   [   2% ] 020/200 VUs  0m02.0s/1m20.0s

running (0m03.0s), 030/200 VUs, 435 complete and 0 interrupted iterations
default   [   4% ] 030/200 VUs  0m03.0s/1m20.0s

running (0m04.0s), 040/200 VUs, 595 complete and 0 interrupted iterations
default   [   5% ] 040/200 VUs  0m04.0s/1m20.0s

running (0m05.0s), 050/200 VUs, 959 complete and 0 interrupted iterations
default   [   6% ] 050/200 VUs  0m05.0s/1m20.0s

running (0m06.0s), 060/200 VUs, 1447 complete and 0 interrupted iterations
default   [   7% ] 060/200 VUs  0m06.0s/1m20.0s

running (0m07.0s), 070/200 VUs, 1877 complete and 0 interrupted iterations
default   [   9% ] 070/200 VUs  0m07.0s/1m20.0s

running (0m08.0s), 080/200 VUs, 2622 complete and 0 interrupted iterations
default   [  10% ] 080/200 VUs  0m08.0s/1m20.0s

running (0m09.0s), 089/200 VUs, 3447 complete and 0 interrupted iterations
default   [  11% ] 089/200 VUs  0m09.0s/1m20.0s

running (0m10.0s), 099/200 VUs, 4215 complete and 0 interrupted iterations
default   [  12% ] 099/200 VUs  0m10.0s/1m20.0s

running (0m11.0s), 100/200 VUs, 4715 complete and 0 interrupted iterations
default   [  14% ] 100/200 VUs  0m11.0s/1m20.0s

running (0m12.0s), 100/200 VUs, 5681 complete and 0 interrupted iterations
default   [  15% ] 100/200 VUs  0m12.0s/1m20.0s

running (0m13.0s), 100/200 VUs, 6615 complete and 0 interrupted iterations
default   [  16% ] 100/200 VUs  0m13.0s/1m20.0s

running (0m14.0s), 100/200 VUs, 7615 complete and 0 interrupted iterations
default   [  17% ] 100/200 VUs  0m14.0s/1m20.0s

running (0m15.0s), 100/200 VUs, 8615 complete and 0 interrupted iterations
default   [  19% ] 100/200 VUs  0m15.0s/1m20.0s

running (0m16.0s), 100/200 VUs, 9615 complete and 0 interrupted iterations
default   [  20% ] 100/200 VUs  0m16.0s/1m20.0s

running (0m17.0s), 100/200 VUs, 9915 complete and 0 interrupted iterations
default   [  21% ] 100/200 VUs  0m17.0s/1m20.0s

running (0m18.0s), 100/200 VUs, 10915 complete and 0 interrupted iterations
default   [  22% ] 100/200 VUs  0m18.0s/1m20.0s

running (0m19.0s), 100/200 VUs, 11815 complete and 0 interrupted iterations
default   [  24% ] 100/200 VUs  0m19.0s/1m20.0s

running (0m20.0s), 100/200 VUs, 12815 complete and 0 interrupted iterations
default   [  25% ] 100/200 VUs  0m20.0s/1m20.0s

running (0m21.0s), 100/200 VUs, 13815 complete and 0 interrupted iterations
default   [  26% ] 100/200 VUs  0m21.0s/1m20.0s

running (0m22.0s), 100/200 VUs, 14815 complete and 0 interrupted iterations
default   [  27% ] 100/200 VUs  0m22.0s/1m20.0s

running (0m23.0s), 100/200 VUs, 15415 complete and 0 interrupted iterations
default   [  29% ] 100/200 VUs  0m23.0s/1m20.0s

running (0m24.0s), 100/200 VUs, 16115 complete and 0 interrupted iterations
default   [  30% ] 100/200 VUs  0m24.0s/1m20.0s

running (0m25.0s), 100/200 VUs, 17062 complete and 0 interrupted iterations
default   [  31% ] 100/200 VUs  0m25.0s/1m20.0s

running (0m26.0s), 100/200 VUs, 18015 complete and 0 interrupted iterations
default   [  32% ] 100/200 VUs  0m26.0s/1m20.0s

running (0m27.0s), 100/200 VUs, 18957 complete and 0 interrupted iterations
default   [  34% ] 100/200 VUs  0m27.0s/1m20.0s

running (0m28.0s), 100/200 VUs, 19860 complete and 0 interrupted iterations
default   [  35% ] 100/200 VUs  0m28.0s/1m20.0s

running (0m29.0s), 100/200 VUs, 20860 complete and 0 interrupted iterations
default   [  36% ] 100/200 VUs  0m29.0s/1m20.0s

running (0m30.0s), 100/200 VUs, 21160 complete and 0 interrupted iterations
default   [  37% ] 100/200 VUs  0m30.0s/1m20.0s

running (0m31.0s), 100/200 VUs, 22160 complete and 0 interrupted iterations
default   [  39% ] 100/200 VUs  0m31.0s/1m20.0s

running (0m32.0s), 100/200 VUs, 23160 complete and 0 interrupted iterations
default   [  40% ] 100/200 VUs  0m32.0s/1m20.0s

running (0m33.0s), 100/200 VUs, 24149 complete and 0 interrupted iterations
default   [  41% ] 100/200 VUs  0m33.0s/1m20.0s

running (0m34.0s), 100/200 VUs, 25060 complete and 0 interrupted iterations
default   [  42% ] 100/200 VUs  0m34.0s/1m20.0s

running (0m35.0s), 100/200 VUs, 26060 complete and 0 interrupted iterations
default   [  44% ] 100/200 VUs  0m35.0s/1m20.0s

running (0m36.0s), 100/200 VUs, 26360 complete and 0 interrupted iterations
default   [  45% ] 100/200 VUs  0m36.0s/1m20.0s

running (0m37.0s), 100/200 VUs, 27360 complete and 0 interrupted iterations
default   [  46% ] 100/200 VUs  0m37.0s/1m20.0s

running (0m38.0s), 100/200 VUs, 28360 complete and 0 interrupted iterations
default   [  47% ] 100/200 VUs  0m38.0s/1m20.0s

running (0m39.0s), 100/200 VUs, 29351 complete and 0 interrupted iterations
default   [  49% ] 100/200 VUs  0m39.0s/1m20.0s

running (0m40.0s), 100/200 VUs, 30260 complete and 0 interrupted iterations
default   [  50% ] 100/200 VUs  0m40.0s/1m20.0s

running (0m41.0s), 109/200 VUs, 31296 complete and 0 interrupted iterations
default   [  51% ] 109/200 VUs  0m41.0s/1m20.0s

running (0m42.0s), 119/200 VUs, 32093 complete and 0 interrupted iterations
default   [  52% ] 119/200 VUs  0m42.0s/1m20.0s

running (0m43.0s), 129/200 VUs, 32846 complete and 0 interrupted iterations
default   [  54% ] 129/200 VUs  0m43.0s/1m20.0s

running (0m44.0s), 139/200 VUs, 34181 complete and 0 interrupted iterations
default   [  55% ] 139/200 VUs  0m44.0s/1m20.0s

running (0m45.0s), 149/200 VUs, 35493 complete and 0 interrupted iterations
default   [  56% ] 149/200 VUs  0m45.0s/1m20.0s

running (0m46.0s), 159/200 VUs, 37028 complete and 0 interrupted iterations
default   [  57% ] 159/200 VUs  0m46.0s/1m20.0s

running (0m47.0s), 169/200 VUs, 38663 complete and 0 interrupted iterations
default   [  59% ] 169/200 VUs  0m47.0s/1m20.0s

running (0m48.0s), 179/200 VUs, 40398 complete and 0 interrupted iterations
default   [  60% ] 179/200 VUs  0m48.0s/1m20.0s

running (0m49.0s), 189/200 VUs, 40952 complete and 0 interrupted iterations
default   [  61% ] 189/200 VUs  0m49.0s/1m20.0s

running (0m50.0s), 199/200 VUs, 42887 complete and 0 interrupted iterations
default   [  62% ] 199/200 VUs  0m50.0s/1m20.0s

running (0m51.0s), 200/200 VUs, 44882 complete and 0 interrupted iterations
default   [  64% ] 200/200 VUs  0m51.0s/1m20.0s

running (0m52.0s), 200/200 VUs, 46699 complete and 0 interrupted iterations
default   [  65% ] 200/200 VUs  0m52.0s/1m20.0s

running (0m53.0s), 200/200 VUs, 48699 complete and 0 interrupted iterations
default   [  66% ] 200/200 VUs  0m53.0s/1m20.0s

running (0m54.0s), 200/200 VUs, 50699 complete and 0 interrupted iterations
default   [  67% ] 200/200 VUs  0m54.0s/1m20.0s

running (0m55.0s), 200/200 VUs, 51899 complete and 0 interrupted iterations
default   [  69% ] 200/200 VUs  0m55.0s/1m20.0s

running (0m56.0s), 200/200 VUs, 53298 complete and 0 interrupted iterations
default   [  70% ] 200/200 VUs  0m56.0s/1m20.0s

running (0m57.0s), 200/200 VUs, 55099 complete and 0 interrupted iterations
default   [  71% ] 200/200 VUs  0m57.0s/1m20.0s

running (0m58.0s), 200/200 VUs, 57099 complete and 0 interrupted iterations
default   [  72% ] 200/200 VUs  0m58.0s/1m20.0s

running (0m59.0s), 200/200 VUs, 59099 complete and 0 interrupted iterations
default   [  74% ] 200/200 VUs  0m59.0s/1m20.0s

running (1m00.0s), 200/200 VUs, 61099 complete and 0 interrupted iterations
default   [  75% ] 200/200 VUs  1m00.0s/1m20.0s

running (1m01.0s), 200/200 VUs, 63099 complete and 0 interrupted iterations
default   [  76% ] 200/200 VUs  1m01.0s/1m20.0s

running (1m02.0s), 200/200 VUs, 63499 complete and 0 interrupted iterations
default   [  77% ] 200/200 VUs  1m02.0s/1m20.0s

running (1m03.0s), 200/200 VUs, 65499 complete and 0 interrupted iterations
default   [  79% ] 200/200 VUs  1m03.0s/1m20.0s

running (1m04.0s), 200/200 VUs, 67499 complete and 0 interrupted iterations
default   [  80% ] 200/200 VUs  1m04.0s/1m20.0s

running (1m05.0s), 200/200 VUs, 69499 complete and 0 interrupted iterations
default   [  81% ] 200/200 VUs  1m05.0s/1m20.0s

running (1m06.0s), 200/200 VUs, 71444 complete and 0 interrupted iterations
default   [  82% ] 200/200 VUs  1m06.0s/1m20.0s

running (1m07.0s), 200/200 VUs, 73299 complete and 0 interrupted iterations
default   [  84% ] 200/200 VUs  1m07.0s/1m20.0s

running (1m08.0s), 200/200 VUs, 74299 complete and 0 interrupted iterations
default   [  85% ] 200/200 VUs  1m08.0s/1m20.0s

running (1m09.0s), 200/200 VUs, 75899 complete and 0 interrupted iterations
default   [  86% ] 200/200 VUs  1m09.0s/1m20.0s

running (1m10.0s), 200/200 VUs, 77899 complete and 0 interrupted iterations
default   [  87% ] 200/200 VUs  1m10.0s/1m20.0s

running (1m11.0s), 182/200 VUs, 79634 complete and 0 interrupted iterations
default   [  89% ] 182/200 VUs  1m11.0s/1m20.0s

running (1m12.0s), 162/200 VUs, 81365 complete and 0 interrupted iterations
default   [  90% ] 162/200 VUs  1m12.0s/1m20.0s

running (1m13.0s), 142/200 VUs, 82895 complete and 0 interrupted iterations
default   [  91% ] 142/200 VUs  1m13.0s/1m20.0s

running (1m14.0s), 124/200 VUs, 84101 complete and 0 interrupted iterations
default   [  92% ] 124/200 VUs  1m14.0s/1m20.0s

running (1m15.0s), 101/200 VUs, 84540 complete and 0 interrupted iterations
default   [  94% ] 101/200 VUs  1m15.0s/1m20.0s

running (1m16.0s), 081/200 VUs, 85460 complete and 0 interrupted iterations
default   [  95% ] 081/200 VUs  1m16.0s/1m20.0s

running (1m17.0s), 063/200 VUs, 86117 complete and 0 interrupted iterations
default   [  96% ] 063/200 VUs  1m17.0s/1m20.0s

running (1m18.0s), 042/200 VUs, 86648 complete and 0 interrupted iterations
default   [  97% ] 042/200 VUs  1m18.0s/1m20.0s

running (1m19.0s), 022/200 VUs, 86978 complete and 0 interrupted iterations
default   [  99% ] 022/200 VUs  1m19.0s/1m20.0s

running (1m20.0s), 001/200 VUs, 87106 complete and 0 interrupted iterations
default   [ 100% ] 001/200 VUs  1m20.0s/1m20.0s

     ✓ status 200

     checks.........................: 100.00% 87107 out of 87107
     data_received..................: 51 MB   634 kB/s
     data_sent......................: 8.9 MB  111 kB/s
     http_req_blocked...............: avg=6.04µs   min=0s       med=2µs      max=23.66ms  p(90)=5µs      p(95)=7µs     
     http_req_connecting............: avg=1.49µs   min=0s       med=0s       max=23.56ms  p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=13.82ms  min=53µs     med=666µs    max=746.11ms p(90)=3.33ms   p(95)=5ms     
       { expected_response:true }...: avg=13.82ms  min=53µs     med=666µs    max=746.11ms p(90)=3.33ms   p(95)=5ms     
     http_req_failed................: 0.00%   0 out of 87107
     http_req_receiving.............: avg=40.81µs  min=3µs      med=12µs     max=83.73ms  p(90)=41µs     p(95)=91µs    
     http_req_sending...............: avg=47.24µs  min=1µs      med=6µs      max=35.34ms  p(90)=70µs     p(95)=206.69µs
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=13.73ms  min=44µs     med=604µs    max=745.71ms p(90)=3.14ms   p(95)=4.68ms  
     http_reqs......................: 87107   1088.110357/s
     iteration_duration.............: avg=114.95ms min=100.08ms med=101.53ms max=846.47ms p(90)=104.92ms p(95)=107.12ms
     iterations.....................: 87107   1088.110357/s
     vus............................: 1       min=1              max=200
     vus_max........................: 200     min=200            max=200


running (1m20.1s), 000/200 VUs, 87107 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/200 VUs  1m20s